[
  {
    "id": "55f56021-2933-41b8-ac32-805b4411b4a0",
    "sort": 1,
    "user_created": "6bdeefd0-bf31-4345-9cab-31f4e577ec3c",
    "date_created": "2024-05-16T04:23:10.397Z",
    "user_updated": "6bdeefd0-bf31-4345-9cab-31f4e577ec3c",
    "date_updated": "2024-05-16T22:35:28.642Z",
    "file_url": "https://www.dropbox.com/scl/fi/5sr8qfnmfqgnnxxokoqxe/directus-ai.mp4?rlkey=l7sbw835wbrdb04t155j59f4w&raw=1",
    "file": null,
    "input_type": "file",
    "text": null,
    "input_name": "Rijk's Keynote",
    "content_workflow": "feed41e6-7f30-4a0e-9cd4-f21549cfb1b0",
    "image": null,
    "file_transcript_text": "\nSpeaker 0: Hello everyone. I'm Rijk, co founder and CTO here at Directus. AI is everywhere. Every company under the sun is doing something with AI but AI can mean a lot of different things Are you using it to generate new information, summarize things you've recorded before, creating images, making analysis, etcetera, etcetera. Shoving that AI into, you know, existing products just for the sake of it can lead to quite a lot of issues.\n\nWe've seen, you know, in recent times, we've seen products with a lot of hype and little follow through, confidently being wrong, some hallucinating, that kind of stuff. Fair to say, for some of those things, implementing AI doesn't really act on the core purpose of the thing, taking the focus away of what really matters most to the users. At Directus, we really don't build things just for the sake of building things. We're always building it because there's a real interest and demand from the users. The same goes for AI.\n\nWe really want to be grounded and considered in our approach around implementing artificial intelligence. Thankfully, we've done our homework. We have something to really ground our decisions in. In our stated data survey we ran a little earlier this year, we saw that 8 out of 10 developers set that they're using artificial intelligence in their day to day work today. So we knew it was something we could take time to consider, but it's important that we stay true to ourselves and our community while we explore this new space even with the industry pressure.\n\nWe want to be able to experiment with AI without spending so much time on it that it starts to affect other work that we're doing. We want to ensure that there is a real customer and user need for everything that we're building. And so we don't really like the idea of having to rely on a single third party service to power, you know, the core director's experience. We still wanna make sure that you can host directus yourself and even run it in isolation air gap from the Internet if you wanted to. So today, we're announcing Directus AI.\n\nDirectus is the toolkit building applications. It's modular, it's powerful, and it places you in control. This is about providing tools to use if you want and when you want that weren't there before. With directors AI, we are providing new ways to augment what parts of Directus can do and enable those 8 and 10 developers who use AI daily to more easily do so through our platform. Through the Directus marketplace, you can download and install a new set of extensions, leveraging the very best in class platforms to build powerful automation.\n\nThis isn't a refocus or reframing of what Directus is. We're taking advantage of Directus' extensibility and marketplace to explore this exciting new opportunity. And today, that forms the basis of our approach to AI. As AI becomes more ubiquitous in the way the developers and everyone work, our views and approach will continue to evolve. But for now, as a company that works with data, we remain cautiously optimistic.\n\nI love to hand it over to Kevin to tell you more about the extension.\n\nSpeaker 1: Thank you very much for that introduction, Rijk, and I'm really excited to talk to you about what we've built. So today, we're bringing AI to Directus Automate with a collection of 10 new operation extensions across 3 categories, data transformation, generation, and analysis. Now today, I'm gonna give you a super quick summary of all 10, but tomorrow we are releasing a brand new series on director's TV, which will go more in-depth into each one, including how to set them up and their use cases. So firstly, we have have the AI transcription operation. You feed it in a media file, and it will output transcripts powered by Deepgram speech recognition API.\n\nThe AI translation operation will take in some text and a target language, and it will translate that text for you. The AI alt text and text extraction operations use Clarify's AI models to describe images and extract text from them, which is super useful for things like, business cards or receipts or things like that. The AI writer operation is really cool. It allows you to pass in some text and select from one of our pre written prompts or you can write your own. It will then process that text and return the output.\n\nOur built in prompts include things like writing social posts, writing SEO descriptions, checking for spelling and grammar, and changing the length of text. This operation also has an advanced mode where you can provide multi step prompts making this super powerful and flexible. The AI image generation operation will take in a prompt and generate an image which you can then save back to your director's project. And, similarly, the AI speech generation operation will take in some written text and one of our selected voices and it will provide a realistic m p three file of that text being read out. This can be useful for things like automated or at scale ad generation or video voiceovers.\n\nThe AI text intelligence operation uses Deepgram's text analysis API to provide summaries, sentiment, intents, and topics for the text that you provide. The AI focal point detection operation uses OpenAI's vision models to determine the primary point of interest in an image, and you can combine this with the new focal point feature for more intelligent image cropping inside of your project. And, finally, the image moderation operation. This will detect drugs, suggestive or explicit material, and gore within images powered by Clarify. This is a great step at helping you build safe and positive applications powered by Directus.\n\nNow all of these operations are available right now in the Directus marketplace, and together, they unlock super powerful workflows that enrich your projects. I'm really excited to talk to you more tomorrow through our new series, Directus AI available on Directus TV about how to actually set these extensions up and chain them together in really interesting ways. But for now on behalf of myself, Rike and the whole directors team thank you so much for tuning in. We're really excited about what we can now do with these extensions and we hope you are too. Okay.\n\nBye for now."
  }
]