[
  {
    "id": "0ab3d59a-de3f-4bbb-b9df-440fe0f00424",
    "posts_id": "d1e214b0-b1a8-4fa5-beca-242a3cd4a268",
    "languages_code": "fr-FR",
    "title": "Directus AI : Améliorez vos projets de données avec des extensions alimentées par l'IA",
    "slug": "annoncer-directus-ai-levate-your-data-projects",
    "content": "# Directus AI : Améliorez vos projets de données avec des extensions alimentées par l'IA\n\nAh, l'intelligence artificielle. Il semble que toutes les entreprises sous le soleil aient sauté dans le train de l'IA, souvent avec plus d'enthousiasme que de bon sens. Dans ce tourbillon de battage médiatique, il est facile de perdre de vue ce qui compte vraiment. Chez Directus, nous croyons à la substance plutôt qu'au spectacle. Aujourd'hui, nous sommes ravis d'annoncer Directus AI - une initiative fondée sur les besoins des utilisateurs et tempérée par un optimisme prudent.\n\n## La genèse de Directus AI\n\nSelon Rijk, notre cofondateur et directeur technique, les initiatives en matière d'IA échouent souvent parce qu'elles ne sont pas ancrées dans les objectifs fondamentaux qu'elles sont censées améliorer. Nous avons tous vu ces produits conçus autour de l'IA, qui promettent la lune mais ne donnent guère plus que des hallucinations fantaisistes. Chez Directus, nous sommes fiers de construire des fonctionnalités dont nos utilisateurs ont réellement besoin. Cette approche n'a pas changé avec Directus AI.\n\nNotre récente enquête a confirmé ce que nous pressentions : 80 % des développeurs utilisent déjà l'IA dans leur travail quotidien. Il ne s'agit pas d'une mode passagère, mais d'une nécessité. Nous avons donc pris notre temps, fait nos devoirs et créé des améliorations de l'IA qui ne vous distrairont pas de ce qui compte vraiment. À savoir, vos données.\n\n## Aperçu des nouvelles extensions d'IA\n\nDirectus AI vous apporte une pléthore de nouveaux outils, plus précisément 10 nouvelles extensions d'opérations d'IA. Celles-ci se répartissent en trois catégories principales : la transformation, la génération et l'analyse des données. Voyons brièvement ce que chacune de ces nouvelles extensions puissantes peut faire pour vous. Croyez-moi, c'est plus excitant que de regarder de la peinture sécher.\n\n1. **Transcription IA** : Donnez-lui vos fichiers multimédias et vous obtiendrez les transcriptions, grâce à l'API de reconnaissance vocale de Deepgram. Utile si vous en avez assez d'entendre votre propre voix.\n\n2. **Traduction IA** : Vous avez déjà eu besoin de traduire un texte dans une autre langue ? Cette opération est faite pour vous. Finies les barrières linguistiques.\n\n3. **AI Alt Text et extraction de texte** : Utilise les modèles de Clarifai pour décrire les images et extraire le texte. Idéal pour les cartes de visite, les reçus ou tout simplement pour impressionner votre patron.\n\n4. **AI Writer** : Saisissez du texte, choisissez une invite et il vous en sortira une version soignée. Qu'il s'agisse d'écrire des posts sociaux, des descriptions SEO ou même de corriger la grammaire, cet outil vous couvre. Il dispose également d'un mode avancé pour les invites en plusieurs étapes, pour ceux qui aiment la complexité.\n\n5. **Génération d'images par l'IA** : Fournissez un message, obtenez une image. C'est aussi simple que cela. Idéal lorsque les photos d'archives ne suffisent pas.\n\n6. **Génération de la parole par l'IA** : Prenez votre texte et choisissez une voix ; elle génère ensuite un fichier MP3. Parfait pour automatiser les publicités ou créer des voix off.\n\n7. **AI Text Intelligence** : Utilise l'API d'analyse de texte de Deepgram pour vous donner des résumés, des sentiments, des intentions et des sujets. Vos textes peuvent enfin avoir de la profondeur.\n\n8. **Détection du point focal par l'IA** : Utilise les modèles de vision d'OpenAI pour identifier le principal point d'intérêt d'une image. Associez-la à la nouvelle fonction de point focal pour un recadrage intelligent des images.\n\n9. **Modération d'images par l'IA** : Également alimentée par Clarifai, elle recherche les drogues, le matériel explicite et le sang. Parce que personne n'aime les mauvaises surprises.\n\n## Intégration et accessibilité\n\nLa question que tout le monde se pose : Comment intégrer ces nouvelles extensions ? Ne vous inquiétez pas, car Directus vous facilite la tâche. Vous pouvez télécharger ces extensions à partir de la place de marché Directus, prêtes à être intégrées dans vos flux de travail existants. C'est un peu comme si vous ajoutiez de nouveaux outils à votre boîte à outils toujours plus grande, mais sans les inconvénients.\n\nCes extensions ne redéfinissent pas ce que Directus peut faire, elles améliorent ce que vous pouvez faire avec Directus. Même si l'IA s'empare du monde, votre contrôle sur vos projets reste absolu. C'est la promesse de Directus.\n\n## That's All Folks\n\nDans cette annonce, nous avons dévoilé Directus AI - un ensemble robuste de nouveaux outils conçus pour améliorer vos projets de données sans vous détourner de ce qui compte le plus. Alors que l'IA continue de s'infiltrer dans toutes les facettes de la technologie, nous nous engageons à vous fournir des fonctionnalités significatives et axées sur l'utilisateur.\n\nPourquoi attendre ? Plongez dans le Marché Directus et explorez ces nouvelles extensions d'IA dès aujourd'hui. Et n'oubliez pas de regarder notre prochaine série TV Directus, où nous approfondirons la configuration et les cas d'utilisation de chaque extension. D'ici là, bonne automatisation.\n\n## En savoir plus\n\n- **[Explorer le marché Directus](https://directus.io/marketplace) pour les nouvelles extensions AI.**\n- **[Regardez notre prochaine série TV Directus](https://directus.io/tv) pour des tutoriels détaillés.**\n"
  },
  {
    "id": "bf555779-3ff8-46ac-9308-0219912c9099",
    "posts_id": "d1e214b0-b1a8-4fa5-beca-242a3cd4a268",
    "languages_code": "en-US",
    "title": "Announcing Directus AI: Elevate Your Data Projects with AI-Powered Extensions",
    "slug": "announcing-directus-ai-elevate-your-data-projects",
    "content": "# Announcing Directus AI: Elevate Your Data Projects with AI-Powered Extensions\n\nAh, artificial intelligence. It seems like every company under the sun has jumped on the AI bandwagon, often with more gusto than sense. In this whirlpool of hype, it’s easy to lose sight of what truly matters. At Directus, we believe in substance over spectacle. Today, we are thrilled to announce Directus AI – an initiative grounded in user needs and tempered by cautious optimism.\n\n## The Genesis of Directus AI\n\nAccording to Rijk, our Co-founder and CTO, AI initiatives often falter because they lack grounding in the core purposes they’re meant to enhance. We’ve all seen those products built around AI, promising the moon but delivering little more than fanciful hallucinations. At Directus, we pride ourselves on building features our users actually need. That approach hasn’t changed with Directus AI.\n\nOur recent survey confirmed what we sensed – 80% of developers are already using AI in their daily work. This isn't just some passing fad; it's a necessity. So, we’ve taken our time, done our homework, and created AI enhancements that won't distract you from what really matters. Namely, your data.\n\n## Overview of New AI Extensions\n\nDirectus AI brings you a plethora of new tools, more specifically, 10 new AI operation extensions. These fall into three main categories: data transformation, generation, and analysis. Let's briefly touch on what each of these powerful new extensions can do for you. Trust me, it’s more exciting than watching paint dry.\n\n1. **AI Transcription**: Feed it your media files, and out come the transcripts, courtesy of Deepgram's speech recognition API. Useful if you’re tired of hearing your own voice.\n\n2. **AI Translation**: Ever need text switched to another language? This operation has you covered. Language barriers, begone.\n\n3. **AI Alt Text and Text Extraction**: Uses Clarifai’s models to describe images and extract text. Ideal for business cards, receipts, or just impressing your boss.\n\n4. **AI Writer**: Enter some text, pick a prompt, and it’ll spit out a polished version. Whether it’s writing social posts, SEO descriptions, or even correcting grammar, this one's got you covered. It also has an advanced mode for multi-step prompting – for those of you who love complexity.\n\n5. **AI Image Generation**: Provide a prompt, get an image. Simple as that. Great for when stock photos just won't cut it.\n\n6. **AI Speech Generation**: Take your text and choose a voice; it then generates an MP3 file. Perfect for automating ads or creating voiceovers.\n\n7. **AI Text Intelligence**: Uses Deepgram's text analysis API to give you summaries, sentiment, intents, and topics. Now, your texts can finally have some depth.\n\n8. **AI Focal Point Detection**: Uses OpenAI’s vision models to identify the primary point of interest in an image. Pair it with the new focal point feature for intelligent image cropping.\n\n9. **AI Image Moderation**: Also powered by Clarifai, it scans for drugs, explicit material, and gore. Because nobody likes unpleasant surprises.\n\n## Integration and Accessibility\n\nSo, the question on everyone's lips: How do you integrate these shiny new extensions? Worry not, for Directus makes it straightforward. You can download these extensions from the Directus Marketplace, ready to slot right into your existing workflows. Think of it like adding new tools to your ever-expanding toolkit, only without the hassle.\n\nThese extensions aren't about redefining what Directus can do; they're about enhancing what you can do with Directus. Even as AI takes over the world, your control over your projects remains absolute. That’s the Directus promise.\n\n## That's All Folks\n\nIn this announcement, we've unveiled Directus AI – a robust set of new tools designed to enhance your data projects without diverting from what matters most. As AI continues to seep into every facet of technology, we remain committed to providing you with meaningful, user-driven features.\n\nWhy wait? Dive into the Directus Marketplace and explore these new AI extensions today. And don't forget to catch our upcoming Directus TV series, where we’ll delve deep into the setup and use cases for each extension. Until then, happy automating.\n\n## Learn More\n\n- **[Explore the Directus Marketplace](https://directus.io/marketplace) for the new AI extensions.**\n- **[Watch our upcoming Directus TV series](https://directus.io/tv) for detailed tutorials.**\n"
  }
]